{
    "42Madrid": [
    {
        "title":"FDF",
        "description":"Este proyecto consiste en representar un paisaje como un objeto tridimensional en los que todas las superficies están delineadas",
        "hashtags": ["C", "Gráficos", "Algoritmos", "Estructuras de datos"],
        "backgroundImage": [
            {
                "src":"assets/fdf_01.jpg",
                 "alt":"Representacion de un mundo"
            }
            ]
        
    },
    {
        "title": "Push Swap",
        "description": "Este proyecto te hará ordenar datos en un stack, con un conjunto limitado de instrucciones, y utilizando el menor número posible de acciones. Para tener éxito, deberás probar a utilizar varios tipos de algoritmos y elegir la solución más apropiada (de entre muchas posibles) para conseguir la ordenación optimizada de los datos.",
        "hashtags": ["C", "Algoritmos", "Estructuras de datos"]
    },
    {
        "title": "Philosophers",
        "description": "Este proyecto te hará resolver un problema clásico de sincronización: el problema de los filósofos. Deberás programar un algoritmo que permita a los filósofos sentarse en una mesa para comer, mientras evitan los problemas de sincronización.",
        "hashtags": ["C", "Threads", "Mutex"]
    },
    {
        "title": "Cub3D",
        "description": "Este proyecto te hará descubrir el ray-casting. La técnica gráfica utilizada en los primeros videojuegos en primera persona.",
        "hashtags": ["C", "Gráficos", "Algoritmos", "Estructuras de datos"]
    },
    {
        "title": "Libft",
        "description": "Este proyecto te hará recodificar funciones de la librería estándar de C, así como otras funciones útiles para tus proyectos.",
        "hashtags": ["C", "Librería estándar"]
    },
    {
        "title": "Get Next Line",
        "description": "Este proyecto te hará recodificar una función que te permitirá leer una línea terminada por un salto de línea desde un descriptor de archivo.",
        "hashtags": ["C", "Librería estándar"]
    },
    {
        "title": "Printf",
        "description": "Este proyecto te hará recodificar la función printf de la librería estándar de C.",
        "hashtags": ["C", "Librería estándar"]
    }
],
    "frontend": [
        {
            "title": "Appointment",
            "description": "Esta app se especializa únicamente en Odontología. Queremos facilitar la organización de turnos para los profesionales, así también aplicaremos distintas funcionalidades como:\n- Visualizar, gestionar y diferenciar por calificación las distintas tarifas o aplicación de descuentos a sus clientes.\n- Generar, limitar y combinar distintos tickets temporales para regalar a sus clientes por bondad del profesional.\n- Organizar los distintos clientes y beneficiarlos con me gusta, una ESTRELLA.",
            "hashtags": [
                "odontologia",
                "turnos",
                "tarifas",
                "descuentos",
                "tickets",
                "clientes",
                "likes",
                "estrella"
            ], "backgroundImage": [
                {
                    "src":"/assets/appointment_home.png",
                     "alt":""
                }
                ]
        },
        {
            "title": "Máquina de Estado: TCP",
            "description": "El sistema ha representar es del Protocolo de Control de Transmisión el cual se encarga de informar del destino de los datos permitiendo la creación de conexiones en 3 etapas.",
            "hashtags": [
                "TCP",
                "Máquina de Estado",
                "Conexiones"
            ],
            "backgroundImage": [
                {
                    "src":"/assets/tcp.png",
                     "alt":""
                }
                ]
        },
        {
            "title":"Microservicios",
            "description":"El proyecto consiste en un sistema de microservicios diseñado para gestionar diferentes aspectos de un negocio mediante una arquitectura distribuida y orientada a microservicios. Estos microservicios se comunican entre sí mediante protocolo HTTP para resolver diversas solicitudes de negocio, siguiendo el principio de responsabilidad única.",
            "hashtags": [
                "TCP",
                "Máquina de Estado",
                "Conexiones"
            ],
            "backgroundImage": [
                {
                    "src":"/assets/tcp.png",
                     "alt":""
                }
            ]
        },
        {
            "title":"Dash Client",
            "description":"Es una app diseñada para administrar los datos de clientes y maquinas de todos los proveedores registrados.",
            "hashtags": [ "ArchitectureBindables", "Kotlin", "XML", "Datos", "Retrofit2","OkHttp3","MaterialComponents","Glide"],
            "backgroundImage": [
                {
                    "src":"/assets/dash_client_01.gif",
                     "alt":""
                }
            ]
        }
    ],
    "backend": "",
    "home":
        {
            "title": "Adrian Herrera",
            "description": "¡El tamaño de fuente en la página importa! Si eliges una fuente que no sea demasiado pequeña ni demasiado grande, harás que la lectura sea mucho más fácil para tus usuarios. Una unidad especial que usan los tipógrafos para describir las fuentes es.",
            "hashtags": [
                "Angular", 
                "TypeScript", "JavaScript", "HTML", "CSS"
            ]

        }
    
}